
export const PERSO_COLORS = [
  '#c8a9d9', '#d9a9b0', '#a9b0d9', '#d9c8b0',
  '#b0d9a9', '#d9b0c8', '#a9c8b0', '#b0a9d9'
]

export const PERSO_AVATARS = [
  '😀','🤠','🥸', '👩🏼','😎','🧑🏻','👨🏻','👩🏻‍🦱','👩🏼‍🦱','🤯',
  '👶', '👦🏽','👦🏿','👩🏽','🧑🏿', '🧑🏼','👨🏼','👩🏽‍🦱','👩🏾‍🦱','🧑🏼‍🦱','🧑🏾‍🦱',
  '🐉','👨‍🦳','👨🏽‍🦳','👱🏾‍♀️','👵🏻','👱🏻‍♀️','🧔🏻‍♀️','👵', '🧓🏼', '🕵🏻‍♀️','🕵🏻‍♂️',
  '🕵🏾‍♂️','👮🏻‍♀️','👮🏽','👩🏻‍🎓', '👩🏾‍🎓','🧑🏼‍🌾','🧑🏽‍🏫',
  '🦊','🦮','🐕‍🦺','🐩','🐴','🐒','🐈','🐈‍⬛','🦜','🦆','🐏'
]

export const PERSO_TYPES = {
    anta:   "Un antangoiste"
  , prota:  "Un protagoniste"
  , ambi:   "Un personnage ambivalent"
}

export const PERSO_FONCTIONS = [
  'protagoniste',
  'antagoniste',
  'deutéragoniste',
  'adjuvant',
  'opposant',
  'personnage secondaire',
  'figurant',
  'narrateur'
]